In [1]:
# Task 1: The file yob2021.txt contains three columns. 
#         The columns are separted by comma.
#         There is no header on the top of the file.

In [2]:
# Task 2: Read the file yob2021.txt into Pandas
import pandas as pd
baby_names = pd.read_csv('./names/yob2021.txt')
baby_names
# From the output, it is observed that as there is no header in this file, it takes the first row as header.

          Olivia  F  17728
0           Emma  F  15433
1      Charlotte  F  13285
2         Amelia  F  12952
3            Ava  F  12759
4         Sophia  F  12496
...          ... ..    ...
31531     Zyeire  M      5
31532       Zyel  M      5
31533      Zyian  M      5
31534      Zylar  M      5
31535        Zyn  M      5

[31536 rows x 3 columns]

In [6]:
baby_names = pd.read_csv('./names/yob2021.txt', names = ['Name','Gender','Count'])
baby_names

            Name Gender  Count
0         Olivia      F  17728
1           Emma      F  15433
2      Charlotte      F  13285
3         Amelia      F  12952
4            Ava      F  12759
...          ...    ...    ...
31532     Zyeire      M      5
31533       Zyel      M      5
31534      Zyian      M      5
31535      Zylar      M      5
31536        Zyn      M      5

[31537 rows x 3 columns]

In [7]:
# Task 3: Print the first 10 rows
baby_names.head(10)

        Name Gender  Count
0     Olivia      F  17728
1       Emma      F  15433
2  Charlotte      F  13285
3     Amelia      F  12952
4        Ava      F  12759
5     Sophia      F  12496
6   Isabella      F  11201
7        Mia      F  11096
8     Evelyn      F   9434
9     Harper      F   8388

In [8]:
# Task 4: Display the number of rows and columns
baby_names.shape
# There are 31537 rows and 3 columns

(31537, 3)

In [9]:
# Task 5: Calculate the total number of babies born in 2021. Sum of third column
baby_names['Count'].sum()

3361375

In [10]:
# Task 6: Caluculate sum for boys and girls separately
baby_names.groupby('Gender').sum()

          Count
Gender
F       1627098
M       1734277

In [13]:
# Task 7: Check your name occurs in the data
baby_names['Name'] == 'Selva'

0        False
1        False
2        False
3        False
4        False
         ...
31532    False
31533    False
31534    False
31535    False
31536    False
Name: Name, Length: 31537, dtype: bool

In [16]:
(baby_names['Name'] == 'Selva').sum()

0

In [17]:
(baby_names['Name'] == 'Selva').value_counts()

False    31537
Name: Name, dtype: int64

In [19]:
baby_names.loc[baby_names['Name']=='Selva']

Empty DataFrame
Columns: [Name, Gender, Count]
Index: []

In [27]:
# Task 8: Calculate the percentage of boys and girls among the total births
Total_births = baby_names['Count'].sum()
Gender_count = baby_names.groupby('Gender').sum()
Percentage = Gender_count/ Total_births * 100
Percentage.round()

        Count
Gender
F        48.0
M        52.0

In [37]:
boys = baby_names.loc[baby_names['Gender'] == 'M']
girls = baby_names.loc[baby_names['Gender'] == 'F']
boys = boys.sort_values(by='Count', ascending=False).head(5)
girls = girls.sort_values(by='Count', ascending=False).head(5)
print(girls['Name'])
print(boys['Name'])

0       Olivia
1         Emma
2    Charlotte
3       Amelia
4          Ava
Name: Name, dtype: object
17544      Liam
17545      Noah
17546    Oliver
17547    Elijah
17548     James
Name: Name, dtype: object

In [41]:
# Task:10 Write the data from Task 9 to an Excel spreadsheet
pd.concat([girls, boys]).to_excel('./top_5_names.xlsx')